app/controllers/users_controller.rb

INSERT INTO `users` (`created_at`, `crypted_password`, `updated_at`, `username`, `password_salt`, `persistence_token`, `email`) VALUES('2009-08-17 22:22:38', '75d43646a5b9fb04728c894ff5607be50a8940cf6f2d274e2e08219206c05f9bae863c0d07b01f22e96eaf82e7df8ff97d7709d946e3fd8be5efc7896cb29ce5', '2009-08-17 22:22:38', 'Ricardo', '68PrJLyJsACDy5c-ujX-', '8a839499704bfa144ffa5ef20a6877ce561f0996e0893c3fdc3f3401ad19d454463633ab16043a9e5f31556a1f542b8635c926dc91f2273f17354ddbf4de2674', 'ricardo@almeida.com')
---
  def create
    @user = User.new(params[:user])
    if @user.save